// /**
//  *? Використовуючи функцію if...else,
//  *? напишіть код, який запитуватиме:
//  *? "Яка офіційна назва JavaScript?"
//  *? Якщо користувач вводить "ECMAScript",
//  *? то показати через alert: "Вірно!"
//  *? інакше відобразити:"Не знаєте? ECMAScript!"
//  */

// const answer = prompt("Яка офіційна назва JavaScript?").toLowerCase().trim();
// if (answer === "ecmascript") {
//     alert("Вірно!");
// }
// else {
//     alert("Не знаєте? ECMAScript!");
//     }
// console.log(answer);
/**
 *
 *
 *? Напишіть цикл, який виводить у консоль
 *? всі парні числа  від max до min  за спаданням
 */
const max = 50;
const min = 23;
for (let i = max; i >= min; i -= 1) {
  if (!(i % 2)) console.log(i);
}

// При завантаженні сторінки користувачеві пропонується
//  *? в prompt ввести число. Введення додається до значення
//  *? змінної total.
//  *? Операція введення числа триває до того часу,
//  *? поки користувач не натисне кнопку Cancel у prompt.
//  *? Після того як користувач припинив введення, натиснувши на
//  *? кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."

//  *! Робити перевірку, що користувач ввів саме число,
//  *! а не довільний набір символів не потрібно.

let number = prompt("Введіть чисо");
let total = 0;
while (number !== null) {
  total = Number(number) + total;
  number = prompt("Введіть чисо");
}
console.log(`Загальна сума введених чисел дорівнює ${total}`);
